Repository: blynn/gitmagic
Catalog: pl/omegat-tmp/omegat/project_save.tmx
Source language: de_de
Languages: pl

source: Anfangs benutzte ich Git bei einem privaten Projekt, bei dem ich der einzige Entwickler war.
pl: Na początku zastosowałem git przy prywatnym projekcie, gdzie byłem jedynym developerem.

source: Angenommen du hast Teil I 'commitet' und zur Prüfung eingereicht.
pl: Przyjmijmy, że wykonałeś 'commit' pierwszej części i przekazałeś do sprawdzenia.

source: Angenommen du hast ein Skript geschrieben und möchtest es anderen zugänglich machen.
pl: Załóżmy, że napisałeś skrypt i chcesz go udostępnić innym.

source: Angenommen, Du hast einen SSH-Zugang zu einem Webserver aber Git ist nicht installiert.
pl: Załóżmy, posiadasz dostęp SSH do serwera stron internetowych, gdzie jednak git nie został zainstalowany.

source: Angenommen, wenn irgendeine Datei in der Objektdatenbank durch einen Laufwerksfehler zerstört wird, dann wird sein SHA1-Hash-Wert nicht mehr mit seinem Inhalt übereinstimmen und uns sagen, wo das Problem liegt.
pl: Przyjmijmy, gdy jakikolwiek plik w objektowej bazie danych ulegnie zniszczeniu poprzez błąd nośnika, to jego SHA1 nie będzie zgadzać i jego zawartością, co od razu wskaże nam problem.

source: Angenommen, wir sind bei D:
pl: Zalozmym ze jestesmy w D:

source: Angenommen, zwei andere Entwickler arbeiten an Deinem Projekt und wir wollen beide im Auge behalten.
pl: Przyjmijmy, dwóch innych programistów pracuje nad twoim projektem i chcielibyśmy mieć ich na oku.

source: Anhang A: Git's Mängel
pl: Załącznik A: Wady GIT

source: Anhang B: Diese Anleitung übersetzen
pl: Załącznik B: Przetłumaszyć to HOWTO

source: Ansonsten:
pl: W przeciwnym razie:

source: Anstatt 'pull' benutzt Du dann:
pl: Zamiast 'pull' skorzystaj z:

source: Anstatt SHA1-Werte aus dem reflog zu kopieren und einzufügen, versuche:
pl: Zamiast kopiować i wklejać klucze z 'reflog', możesz:

source: Anstatt die Details aufzudecken, bieten wir grobe Anweisungen für die jeweiligen Funktionen.
pl: Zamiast wchodzić głęboko w szczegóły, oferujemy proste instrukcje do odpowiednich funkcji.

source: Anstatt jede Änderung per Hand zu untersuchen, automatisiere die Suche durch Ausführen von:
pl: Zamiast sprawdzania zmian ręcznie, możesz zautomatyzowć poszukiwania za pomocą skryptu:

source: Anstelle des zweiten Befehl kann man auch `git commit -a` ausführen, falls man an dieser Stelle ohnehin 'comitten' möchte.
pl: Zamiast tego drugiego polecenia możemy użyć `git commit -a`, jeśli i tak mamy zamiar przeprowadzić 'comitt'.

source: Antworte mit "y" für Ja oder "n" für Nein.
pl: Odpowiedz po prostu "y" dla tak, albo "n" dla nie.

source: Arbeit ist Spiel
pl: Praca jest zabawą

source: Arbeite wie du willst
pl: Pracuj jak chcesz

source: Arbeitest du an einem Projekt, das ein anderes Versionsverwaltungssystem nutzt und vermisst du Git?
pl: Pracujesz nad projektem, który używa innego systemu kontroli wersji i tęsknisz za GIT?

source: Argh!
pl: Och!

source: Auch auf Deiner Seite ist alles was Du brauchst ein eMail-Konto: es gibt keine Notwendigkeit ein Online Git 'Repository' aufzusetzen.
pl: Również i z twojej strony wszystko, czego ci potrzeba to fukcjonujące konto mailowe: nie istnieje konieczność zakładania repozytorium online.

source: Auch wenn Git die Kosten durch Dateifreigaben und Verknüpfungen reduziert, müssen doch die gesamten Projektdateien im neuen Arbeitsverzeichnis erstellt werden.
pl: Nawet jesli GIT redukuje koszty poprzez udostepnienie danych i skroty, wszystkie pliki projektu musza znalezc sie w nowym katalogu roboczym.

source: Auch wenn du den ``master'' 'Branch' umbenennen oder auslöschen könntest, kannst du diese Konvention aber auch respektieren.
pl: Nawet jeśli mógłbyś skasować lub zmienić nazwę na inną, możesz tą konwencję respektować

source: Auch wenn wir später Nachteile beim verteilten Ansatz sehen werden, ist man mit dieser Faustregel weniger anfällig für falsche Vergleiche.
pl: Również, gdy w późniejszym czasie dostrzeżemy wady systemów rozproszonych, można to przyjąć jako ogólną zasade mniej podatną na złe porównania.

source: Auf Debian und Ubuntu, findet man dieses Verzeichnis unter +/usr/share/doc/git-core/contrib+.
pl: W dystrybucji debian i ubuntu znajdziemy ten katalog pod +/usr/share/doc/git-core/contrib+.

source: Auf Git bauen
pl: Budować na git

source: Auf dem zentralen Server erstelle ein 'bare Repository' in irgendeinem Ordner:
pl: Na centralnym serwerze utwóż tzw BARE REPOSITORY w jakimkolwiek katalogu

source: Auf der Empfängerseite speichere die eMail in eine Datei, dann gib ein:
pl: Po stronie odbiorcy zapamiętaj email jako daną i podaj:

source: Auf der anderen Seite, wenn Du einen speziellen Pfad für 'checkout' angibst, gibt es keinen Sicherheitsüberprüfungen mehr.
pl: Jeśli poleceniu 'checkout' podamy inną ścieżkę, środki ochrony nie znajdą zastosowania.

source: Aufgedeckte Geheimnisse
pl: Uchylenie tajemnicy

source: Aus diesem Grund plädiere ich für Git statt Mercurial für ein zentrales 'Repository', auch wenn man Mercurial bevorzugt.
pl: Dlatego jestem za używaniem GIT jako centralnegoo składu, nawet gdy preferujesz Mercurial

source: Außerdem kannst du sie komprimieren um Speicherplatz zu sparen.
pl: Poza tym możesz je jeszcze spakować, by zaoszczędzić miejsce na dysku.

source: Außerdem können so alle Übersetzungen in einem 'Repository' existieren.
pl: Poza tym wszystkie tłumaszenia mogą być prowadzone w jednym repozytorium.

source: Außerdem könnte dein Projekt weit über die ursprünglichen Erwartungen hinauswachsen.
pl: Poza tym może sie zdarzyć, że twój projekt daleko przerośnie początkowe oczekiwania.

source: Außerdem kümmert sich Git um die Details wie Autorname und eMail-Adresse, genauso wie um Datum und Uhrzeit und es fordert den Autor zum Beschreiben seiner eigenen Änderungen auf.
pl: Pozatym Git martwi się o szczegóły, jak nazwa autora i adres maila, tak samo jak i o datę i godzinę oraz motywuje autora do opisywania swoich zmian.

source: Außerdem waren sich die Entwickler der Popularität und Interoperabilität mit anderen Versionsverwaltungssystemen bewusst.
pl: Pozatem programiści byli świadomi popularności i wagi interakcji z innymi systemami kontroli wersji.

source: B ist identisch mit A, außer dass einige Dateien gelöscht wurden.
pl: B rozni sie od A, jedynie tym, ze usunieto kilka plikow.

source: Bazaar hat den Vorteil des Rückblicks, da es relativ jung ist; seine Entwickler konnten aus Fehlern der Vergangenheit lernen und kleine historische Unwegbarkeiten umgehen.
pl: Bazar ponieważ jest to stosunkowo młody, posiada zaletę perspektywy czasu; jego twórcy mogli uczyć się na błędach z przeszłości i uniknąć historycznych naleciałości.

source: Beachte, dass alle Änderungen, die nicht 'commitet' sind übernommen werden.
pl: Zauwaz, ze wszystkie zmiany, ktorre nie zostaly 'commit', zostaly przejete

source: Bearbeite das Makefile und füge das Sprachkürzel zur Variable `TRANSLATIONS` hinzu.
pl: Edytuj Makefile i dodaj skrót języka do zmiennej `TRANSLATIONS`.

source: Beginne ein paar 'Branches':
pl: Wystartuj kilka BRANCHES:

source: Bei Softwareprojekten kann das ähnlich sein.
pl: W projektach programistycznych moze to wygladac podobnie.

source: Bei einem 'pull' aus anderen 'Repositories' müssen wir explizit angeben, welchen 'Branch' wir wollen:
pl: Przy 'pull' z innego repozytorium musimy podać z którego branch chcemy korzystać.

source: Bei einem Mercurial Projekt gibt es gewöhnlich immer einen Freiwilligen, der parallel dazu ein Git 'Repository' für die Git Anwender unterhält, wogegen, Dank der `hg-git`-Erweiterung, ein Git Projekt automatisch die Benutzer von Mercurial mit einbezieht.
pl: W projektach prowadzonych za pomocą Mercurial często znajdziemy woluntariusza, który równolegle prowadzi skład GIT, do którego za pomocą rozszerzenia hg-git, synchronizowany jest automatycznie z użytkownikami GIT

source: Bei einigen Computerspielen bestand ein gesicherter Stand wirklich aus einem Ordner voller Dateien.
pl: Niektóre gry komputerowe składały sie rzeczywiście z jednego katalogu pełnego plików.

source: Bei meinen Projekten verwaltet Git genau die Dateien, die ich archivieren und für andere Benutzer veröffentlichen will.
pl: Git zarządza w moich projektach dokładnie tymi danymi, które chcę archiwizować i dać do dyspozycji innym użytkownikom.

source: Bei regelmäßiger Anwendung wirst Du allmählich verstehen, wie die Tricks funktionieren und wie Du die Rezepte auf Deinen Bedarf zuschneiden kannst.
pl: Podczas regularnego korzystania sam dojdziesz do tego, jak te sztuczki funkcjpnują i jak możesz dopasować podane instrukcje na swoje własne potrzeby.

source: Bei verteilen Systemen ist das viel besser, da wir die benötigt Version lokal 'clonen' können.
pl: Przy podzielonych systemach wyglada to duzo lepiej, poniewaz mozemy potrzebna wersje skonowac lokalnie

source: Bei älteren Git Versionen funktioniert der 'copy'-Befehl nicht, stattdessen gib ein:
pl: Przy starszych wersjach git samo polecenie 'cp' nie będzie funkcjonować, wtedy musisz jeszcze:

source: Beide laden ihre Änderungen hoch.
pl: Obydwoje ładują swoje zmiany na serwer.

source: Beim Editieren kannst du deine Datei durch 'Speichern unter ...' mit einem neuen Namen abspeichern oder du kopierst sie vor dem Speichern irgendwo hin um die alte Version zu erhalten.
pl: Podczas edytowania, by uchronić starą wersję, możesz poprzez wybranie 'zapisz jako ...' zapisać twój dokument pod inną nazwą lub zapamiętać w innym miejscu.

source: Beim nächsten Mal werden diese lästigen Anweisung gehorchen!
pl: Następnym razem te uciążliwe polecenia zaczną znów być posłuszne.

source: Benutze *git submodule* wenn Du trotzdem alles in einem einzigen 'Repository' halten willst.
pl: Korzystaj z *git submoduleć jeśli mimo to chcesz cały twój projekt mieć w tym samym repozytorium.

source: Beschaffe dir die `hg-git`-Erweiterung mit Git:
pl: Sciągnij sobie rozszerzenie hg-git za pomocą GIT:

source: Betrachten wir Webbrowser.
pl: Przyjżyjmy się takiej przeglądarce internetowej.

source: Bevor wir uns in ein Meer von Git-Befehlen stürzen, schauen wir uns ein paar einfache Beispiele an.
pl: Zanim zmoczymy nogi w morzu polecen GIT, przyjrzyjmy sie kilku prostym poleceniom

source: Bis jetzt haben wir Git's berühmten 'Index' gemieden, aber nun müssen wir uns mit ihm auseinandersetzen um das bisherige zu erklären.
pl: Do tej pory staraliśmy się omijać sławny 'index' GIT, jednak przyszedł czas się nim zająć, aby wyjaśnić wszystko to co poznaliśmy do tej pory.

source: Bisher haben wir unmittelbar nach dem Erstellen in einen 'Branch' gewechselt, wie in:
pl: Do tej pory przechodziliśmy do nowo utworzonego BRANCH, tak jak w:

source: Bisher kümmert sich Git nur um Dateien, die existierten, als du das erste Mal *git add* ausgeführt hast.
pl: Do tej pory git zajal sie jedynie plikami, ktore juz istnialy podczas gdy wykonales poraz pierwszy polecenie *git add*

source: Blobs
pl: Bloby

source: Changelog erstellen
pl: Utwożenie historii

source: Chronik umschreiben
pl: Przepisanie historii

source: Computer synchronisieren
pl: Synchronizacja komputera

source: Computerspiele machten das lange Zeit so, viele von ihnen hatten automatisch erstellte Sicherungspunkte mit Zeitstempel.
pl: Gry komputerowe robią tak już od długiego czasu, wiele z nich posiada automatycznie utworzone punkty opatrzone sygnaturą czasu.

source: Da Git die Änderungen über das gesamte Projekt aufzeichnet, erfordert die Rekonstruktion des Verlaufs einer einzelnen Datei mehr Aufwand als in Versionsverwaltungssystemen die einzelne Dateien überwachen.
pl: Pomieważ Git loguje zmiany tylko dla całości projektu jako takiego, rekonstrukcja przebiegu zmian pojedyńczego pliku jest bardziej pracochłonna, niż w innych systemach, które kontrolują poledyńcze pliki.

source: Da das Abfragen des Dateistatus erheblich schneller ist als das Lesen der Datei, kann Git, wenn Du nur ein paar Dateien verändert hast, seinen Status im Nu aktualisieren.
pl: Ponieważ sprawdzenie statusu pliku trwa dużo krócej niż jego całkowite wczytanie, to jeśli dokonałaś zmian tylko na kilku plikach Git zaktualizuje swój stan w mgnieniu oka.

source: Da die Dateien im 'Repository' unter dem 'Commit' A gespeichert sind, können wir sie wieder herstellen:
pl: Poniewaz dane zostaly zapamietane w COMMIT A, mozemy je przywrocic

source: Da diese Anweisung aber auch zu ignorierende Dateien hinzufügt, kann man noch die `-x` oder `-X` Option hinzufügen.
pl: Ale ponieważ to polecenie dodaje również pliki które powinny być zignorowane, można dodać do niego jeszcze opcje `-x` albo `-X`

source: Da ich in erster Linie unter Linux arbeite, sind Probleme anderer Plattformen bedeutungslos.
pl: Ponieważ w pierwszej lini pracuje na linuksie, problemy innych platworm nie mają dla mnie znaczenia.

source: Da war auch ein interessanter http://de.wikipedia.org/wiki/Tragik_der_Allmende[Tragik-der-Allmende] Effekt: Netzwerküberlastungen erahnend, verbrauchten einzelne Individuen für diverse Operationen mehr Netzwerkbandbreite als erforderlich, um zukünftige Engpässe zu vermeiden.
pl: Był też taki ciekawy efekt http://pl.wikipedia.org/wiki/Tragedia_wsp%C3%B3lnego_pastwiska[tragedii-wspólnego-pastwiska]: przypominający przeciążenia w sieci - pojedyńcze indywidua pochłaniają więcej pojemności sieci niż to konieczne, by uchronić się przed mogącymi ewentualnie wystąpić w przyszłości niedoborami.

source: Dadurch agieren nun alle Git Anweisungen als hätte es die drei letzten 'Commits' nicht gegeben, während deine Dateien unverändert erhalten bleiben.
pl: Spowoduje to, że wszystkie następne komendy GIT będą reagować, jakby tych trzech ostatnich 'commits' wogóle nie było, podczas gdy twoje dane nie zmienią się.

source: Dafür ist es nun zu spät.
pl: Na to jest już za późno.

source: Damit alles zu unserem Beispiel passt, müssen wir ein wenig tricksen:
pl: By wszystko do naszego przykładu pasowało, musimy trochę pokombinować.

source: Damit springst du in der Zeit zurück, behältst aber neuere Änderungen.
pl: Tym poleceniem wrócisz się w czasie zachowując jednak nowsze zmiany.

source: Danach beschreibt der Ordner +.git/refs/original+ den Zustand der Lage vor der Operation.
pl: Po tej operacji katalog +.git/refs/original+ opisuje stan przed jej wykonaniem.

source: Dank des schmerzlosen 'Branchen' und 'Mergen' können wir die Regeln beugen und am Teil II arbeiten, bevor Teil I offiziell freigegeben wurde.
pl: Dzieki bezbolesnemu 'branch' i 'merge' mozemy te regoly naciagnac i pracowac nad druga czescia jeszcze zanim pierwsza zostanie oficjalnie zatwierdzona

source: Danke!
pl: Dziękuję!

source: Dann 'branche' zu Teil II:
pl: Najpierw zmień 'branch' do części drugiej

source: Dann 'commite' dein Projekt und gib ein:
pl: Wtedy COMMIT twój projekt i wykomaj:

source: Dann auf dem anderen:
pl: Potem na następnym:

source: Dann erstelle ein Git 'Repository' in deinem Arbeitsverzeichnis:
pl: Utwórz GIT REPOSITORY w katalogu roboczym

source: Dann erzähle jedem von deiner 'Fork' des Projekts auf deinem Server.
pl: No i poinformuj wszystkich o twoim fork projektu na twoim serwerze.

source: Dann gehe wieder ins neue Verzeichnis und gib ein:
pl: Następnie przejdź do dowego katalogu i podaj:

source: Dann gib ein:
pl: Wpisujesz:

source: Dann ist es unmöglich ohne menschlichen Eingriff fortzufahren.
pl: W tym wypadku dalsze praca nie będzie możliwa bez ludzkiego udziału.

source: Dann mache diese Änderungen und gib ein:
pl: Wykonaj je i wpisz:

source: Dann mache folgendes auf deinem Server:
pl: To po prostu zwób coś takiego na twoim serwerze:

source: Dann nutze:
pl: Możesz w tym wypadku skorzystać z:

source: Dann sage deinen Nutzern:
pl: Następnie udostępnij link twoim użytkownikom:

source: Dann tippe:
pl: Wpisz wtedy:

source: Dann, erstelle ein Git 'Repository' aus dieser temporären Datei, durch Eingabe von:
pl: Następnie utwórz repozytorium git z tymczasowego pliku poprzez wpisanie:

source: Dann, wenn du den Fehler behoben hast:
pl: Jak juz uporasz sie z bledem:

source: Dann:
pl: Wtedy:

source: Das 'Mergen' mehrerer 'Branches' erzeugt einen 'Commit' mit mindestens zwei Eltern.
pl: 'merge' kilku 'branche' wytwarza 'commit' z minimum 2 rodzicami.

source: Das 'Repository' kann nun nicht mehr über das Git-Protokol abgerufen werden; nur diejenigen mit SSH Zugriff können es einsehen.
pl: To REPOSITORY nie może komunikować sie poprzez protokół GIT, tylko posiadający dostęp przez SSH mogą widzieć dane.

source: Das +contrib+ Unterverzeichnis ist eine Fundgrube von Werkzeugen, die auf Git aufbauen.
pl: Podkatakog +contrib+ jest wielkim znaleziskiem narzędzi zbudowanych dla git.

source: Das Beispiel 'post-update' Skript aktualisiert Dateien, welche Git für die Kommunikation über 'Git-agnostic transports' wie z.B. HTTP benötigt.
pl: Ten przykładowy 'post-update' skrypt aktualizuje dane, które potrzebne są do komunikacji poprzez 'Git-agnostic transports', jak na przykład HTTP.

source: Das Geheimnis liegt in der Konfiguration, die beim 'Clonen' erzeugt wurde.
pl: Tajemnica leży w konfiguracji, która utworzona zostaje podczas klonowania.

source: Das Neueste vom Neuen
pl: Najnowsze z nowych

source: Das Problem ist, den entsprechenden SHA1-Wert zu finden.
pl: Problemem staje się tutaj odnalezienie odpowieniego klucza SHA1.

source: Das Rückgängig machen wird als neuer 'Commit' erstellt, was mit *git log* überprüft werden kann.
pl: To wycofanie zostanie zapamiętane jako nowy COMMIT, co można sprawdzić poleceniem *git log*.

source: Das Unterverzeichnis `refs` enthält den Verlauf aller Aktivitäten auf allen 'Branches', während `HEAD` alle SHA1-Werte enthält, die jemals diese Bezeichnung hatten.
pl: Podkatalog `refs` zawieza przebiek wszystkich aktywności we wszystkich 'branches', podczas gdy `HEAD` wszystkie klucze SHA1 które kiedykolwiek posiadały ten opis.

source: Das `tailor` Programm konvertiert Bazaar 'Repositories' zu Git 'Repositories' und kann das forlaufend tun, während `bzr-fast-export` für einmalige Konvertierungen besser geeignet ist.
pl: Program `tailor` konwertuje składy Bazaar do składów Git i może zrobić na bieżąco, podczas gdy `bzr-fast-export` lepiej nadaje się do jednorazowej konwersji.

source: Das bedeutet auch, dass sich der SHA1-Hash-Wert des offiziellen HEAD von dem des manipulierten 'Repository' unterscheidet.
pl: Oznacza to również, że klusz oficjalnego HEAD różni się od klucza HEAD manipulowanego rapozytorium.

source: Das dritte ist ein 'Commit'-Objekt.
pl: Ten trzeci to objekt 'commit'

source: Das erfordert aber die Mitarbeit der Programmierer, denn sie müssen die Skripte auch aufrufen, wenn sie eine Datei bearbeiten.
pl: Wymaga to jednak współdziałania programistów, ponieważ muszą również korzystać z tych skryptów podczas pracy nad plikiem.

source: Das funktioniert wahrscheinlich ganz gut, wenn auch unklar ist, warum jemand die Versionsgeschichte von wahnsinnig instabilen Dateien braucht.
pl: Prawdopodobnie będzie to dość dobrze działać, mimo iż nie jest do końca jasne komu potrzebna jest znajomość przebiegu tak ogromnej ilości niestabilnych danych.

source: Das führende `blob 6` ist lediglich ein Vermerk, der sich aus dem Objekttyp und seiner Länge in Bytes zusammensetzt; er vereinfacht die interne Verwaltung.
pl: Początkowe `blob 6`, to jedynie adnotacja, która określa jedynie rodzaj objektu i jego wieklość w bajtach, pozwala to na uproszczenie zarządzania wewnętrznego.

source: Das geht wesentlich schneller, aber der resultierende Klon hat nur eingeschränkte Funktionalität.
pl: Trwa to o wiele krócej, nimniej jednak klon taki posiada tylko ograniczoną finkcjonalność.

source: Das gilt stellvertretenden für andere Anweisungen.
pl: Reprezentuje to również wszystkie inne polecenia.

source: Das hast Du vielleicht noch nicht bemerkt, denn Git versteckt diese: Du musst speziell danach fragen.
pl: Może jeszcze tego nie zauważyłeś, ponieważ Git je ukrywa: musisz się o nie specjalnie pytać:

source: Das heißt auch, dass sie jeden SHA1-Hash-Wert der 'Tree'-Objekte ändern müssen, welche dieses Objekt referenzieren und demzufolge alle SHA1-Hash-Werte der 'Commit'-Objekte, welche diese 'Tree'-Objekte beinhalten, zusätzlich zu allen Abkömmlingen dieses 'Commits'.
pl: To znaczy róniweż, że musiałabyś zmienić każdy klucz objektu 'tree', które ją referują oraz w wyniku tego wszystkie klucze 'commits' zawierające obejkty 'tree' dodatkowo do pochodnych tych 'commits'.

source: Das heißt, bis Du sie brauchst.
pl: To znaczy - do czasu aż będzie ci potrzebna.

source: Das heißt, nachdem Du ein 'Bundle' gesendet hast, gib ein:
pl: To znaczy, po wysłaniu 'bundle', podaj:

source: Das ist Deine eigene Kopie der Versionsgeschichte, damit kannst Du so lange offline bleiben, bis Du mit anderen kommunizieren willst.
pl: Jest to twoja własna kopie całej historii, z którą mogłabyś pracować offline, aż do momentu gdy zechcesz wymienić dane z innymi.

source: Das ist der erste 'Commit' gewesen, deshalb gibt es keine Eltern-'Commits'.
pl: To jest pierwszy 'commit', przez to nie posiada rodziców 'commit'.

source: Das ist ein großartiger Ansatz, um an Git heranzugehen: Anfänger können seine inneren Mechanismen ignorieren und Git als ein Ding ansehen, das mit seinen erstaunlichen Fähigkeiten Freunde verzückt und Gegner zur Weißglut bringt.
pl: Jest to wspaniałe podejście, by zacząć pracę z Git: Amatorzy mogą zognorować swoje wewnętrzene mechanizmy i ujrzeć Git jako rzecz, która urzeka przyjaciół swoimi niezwykłymi możliwościami, a przeciwników doprowadza do białej gorączki.

source: Das ist eine Aufgabe für *git rebase*, wie oben beschrieben.
pl: To zadanie dla *git rebase*, jak wyżej opisane.

source: Das ist eine primitive und mühselige Form der Versionsverwaltung.
pl: Jest to prymitywna i pracochłonna forma kontroli wersji.

source: Das ist unüblich.
pl: Znajduje to dość szerokie zastosowanie

source: Das ist wie bei den Spielen der alten Schule, die nur Speicherplatz für eine Sicherung hatten: sicherlich konntest du speichern, aber du konntest nie zu einem älteren Stand zurück.
pl: To jak w grach starej szkoły, które posiadały pamięć na zapisanie tylko jednego stanu: oczywiście, mogłeś zapamiętać, ale nigdy nie mogłeś wrócic do starszego stanu.

source: Das kannst Du kontrollieren, durch die Eingabe von:
pl: Możesz to skontrolować wpisując:

source: Das kannst du mit folgendem Befehl erstellen:
pl: Możesz go utwoszyć korzystając z polecenia:

source: Das neue Verzeichnis enthält die Dateien mit deinen Änderungen.
pl: Twoj nowy katalog posiada dane z przez ciebie wprowadzonymi zmianami

source: Das neue Verzeichnis und die Dateien darin kann man sich als 'Clone' vorstellen, mit dem Unterschied, dass durch die gemeinschaftliche Versionsgeschichte die beiden Versionen automatisch synchron bleiben.
pl: Ten nowy katalog i znajdujące się w nim pliki można sobie wyobrazić jako klon, z tą różnicą, że ze względu na wspólną niepodzieloną historie obje wersje pozostaną zsynchronizowane.

source: Das obige erklärt, warum einige von unseren früheren 'push' und 'pull' Beispielen keine Argumente hatten.
pl: To wyjaśnia dlaczego nasze poprzednie przykłady z 'push' i 'pull' nie posiadały argumentów.

source: Das setzt voraus, dass sie einen SSH-Zugang haben.
pl: Wymaga to od nich posiadanie klucza SSH do twojego komputera.

source: Das sichert den aktuellen Stand an einem temporären Ort ('stash'=Versteck) und stellt den vorherigen Stand wieder her.
pl: Polecenie to zabezpiecza aktualny stan w tymczasowym miejscu (STASH = ukryj) i przywraca poprzedni stan.

source: Das ursprüngliche Git-Protokoll ähnelt HTTP: Es gibt keine Authentifizierung, also kann jeder das Projekt abrufen.
pl: Protokół GIT przypomina HTTP: nie posiada autentyfikacji, więc każdy może zładować dane.
